{
  "about": {
    "summary": "🌟 Greetings! I'm Adeel Abid, a nocturnal frontend sorcerer boasting expertise in  ReactJS, Redux Toolkit, and the enchanting arts of Tailwind CSS and SASS. With a magical coding journey spanning over 2 years, I've summoned responsive, user-friendly web spells that deliver a seamless user experience. My quest through the realms of frontend libraries and frameworks has been a thrilling adventure, crafting pixel-perfect designs and unraveling the secrets of UI/UX magic. 🚀 In this ever-evolving tech cosmos, I thrive on staying ahead, embracing the latest enchantments. Armed with 2 years of coding mastery, my mission is to conjure spells of clean, maintainable code—a testament to my commitment to creating digital experiences that transcend time. Let's embark on a journey together, where code dances and user experiences sparkle in the mystical glow of technology! ✨🌟",
    "img": "/adeel.webp"
  },
  "experiences": [
    {
      "img": "Ziscomm.webp",
      "companyName": "ZISCOMM Pvt Ltd",
      "role": "Frontend Software Engineer",
      "startDate": "Sep 2023",
      "endDate": "Present",
      "techStack": ["reactjs", "redux", "vscode"],
      "summary": [
        "As a Frontend Developer, I contribute to the development of a CRM project, leveraging MongoDB, Express.js, React, and Node.js.",
        "My responsibilities include implementing features, debugging, and collaborating with senior developers to  ensure project success",
        "Through this role, I continuously enhance my skills in Frontend development within a dynamic team environment"
      ]
    },
    {
      "img": "ist.webp",
      "companyName": "Institute of Space and Technology",
      "role": "Frontend Developer",
      "startDate": "Sep 2022",
      "endDate": "Sep 2023",
      "techStack": ["redux", "tailwind", "reactjs", "vscode"],

      "summary": [
        "Designed the user Interface of my Final Year Project (Online Car Service Station System) with user and admin panel having the functionality of adding services by user to cart.",
        "Efficient, dynamic, and user-friendly."
      ]
    },
    {
      "img": "fiver.webp",
      "companyName": "Fiver",
      "role": "Reactjs Developer",
      "startDate": "Jun 2021",
      "endDate": "Jul 2023",
      "techStack": [
        "reactjs",
        "redux",
        "tailwind",
        "firebase",
        "vscode",
        "photoshop",
        "xd"
      ],
      "summary": [
        "Completed 10+ projects as a Frontend Developer, specializing in website development and management systems.",
        "Delivered tailored solutions for small businesses, optimizing their online presence and functionality.",
        "Applied a customer-centric approach, ensuring client satisfaction and receiving positive reviews on both Fiverr and Upwork platforms.",
        "Demonstrated versatility by successfully handling a variety of projects, showcasing adaptability to different industries and client needs."
      ]
    }
  ],
  "projects": [
    {
      "Name": "Ecommerce",
      "Summary": "Created a full-fledged e-commerce app with product pages, cart and checkout flow, and used following Technoligies ==> HTML, CSS, Sass, Bootstrap, JavaScript, ReactJS, Redux Toolkit, GitHub, Vercel. ",
      "img": "ecomm.webp",
      "link": "https://adeel-ecommerce.vercel.app/"
    },
    {
      "Name": "Wordpress Theme Clone",
      "Summary": "Cloned a wordpress theme during my Internship, and used following Technologies ==> HTML, CSS, JavaScript, Bootstrap, React.js, GitHub, Vercel. ",
      "img": "wordpress.webp",
      "link": "https://wordpress-theme.vercel.app/"
    },
    {
      "Name": "Online Car Service Station",
      "Summary": "Designed the user Interface of my Final Year Project (Online Car Service Station System) with user and admin panel having the functionality of adding services by user to cart, Like Ecommerce.",
      "img": "ocss.webp",
      "link": "/"
    }
  ],
  "skills": [
    {
      "title": "Languages",
      "set": [
        { "name": "c++", "proficiency": 65 },
        { "name": "html", "proficiency": 90 },
        { "name": "javaScript", "proficiency": 85 }
      ]
    },
    {
      "title": "Teachnologies",
      "set": [
        { "name": "css", "proficiency": 90 },
        { "name": "tailwind", "proficiency": 80 },
        { "name": "bootstrap", "proficiency": 80 },
        { "name": "reactjs", "proficiency": 90 },
        { "name": "primereact", "proficiency": 80 },
        { "name": "nextjs", "proficiency": 80, "bg": true },
        { "name": "redux", "proficiency": 80 },
        { "name": "sass", "proficiency": 85 }
      ]
    },
    {
      "title": "Tools",
      "set": [
        { "name": "vscode", "proficiency": 65 },
        { "name": "git", "proficiency": 75 },
        { "name": "github", "proficiency": 80 },
        { "name": "jira", "proficiency": 80 }
      ]
    }
  ]
}
